cfe llm/DataProcessors/AI_ЧатПоДаннымБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>AI_ЧатПоДаннымБазы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвтосохранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодАвтосохранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФормам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеТипыДанных</Name>
					<Type>
						<v8:Type>v8:TypeDescription</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла XML, где хранятся запросы и параметры.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВРезультатахЗапросаЗначенияСсылок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбхода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧередованиеЦветовВРезультатеЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделительФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя запроса</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Comment>Текст запроса</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения в секундах</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСтрок</Name>
							<Comment>Количество возвращаемых строк в результате запроса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресРезультата</Name>
							<Comment>Адрес временного хранилища, где хранится результат</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресРезультатовЗапроса</Name>
							<Comment>Адрес массива результатов запроса во временном  хранилище</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресХранилищаПланаЗапроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Comment>Идентификатор</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЗапроса</Name>
							<Comment>Идентификатор запроса</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя параметра</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Comment>Тип</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cfe llm/DataProcessors/AI_ЧатПоДаннымБазы/Forms/ФормаЗамераВремени/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Замер времени выполнения: " + Параметры.ИмяЗапроса;
	
	ПараметрыПередачи = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
	
	Объект.Запросы.Загрузить(ПараметрыПередачи.Запросы);	
	Объект.Параметры.Загрузить(ПараметрыПередачи.Параметры);
		
	ИдентификаторТекущегоЗапроса = ПараметрыПередачи.ИдентификаторТекущегоЗапроса;
	
	Попытка
		
		// Синтаксический контроль запроса
		Для каждого СтрокаЗапроса Из Объект.Запросы Цикл		
			Если СтрокаЗапроса.Идентификатор = ИдентификаторТекущегоЗапроса Тогда			
				СхемаЗапроса = Новый СхемаЗапроса;
				СхемаЗапроса.УстановитьТекстЗапроса(СтрокаЗапроса.Текст);
				ТекстЗапроса = СтрокаЗапроса.Текст;
			КонецЕсли;		
		КонецЦикла; 	
	
	Исключение
		
		Отказ = Истина;
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗамер(Команда)
	ВыполнитьЗамерНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗаписей(Команда)
	
	ПоказыватьКоличествоЗаписейВТ = Не ПоказыватьКоличествоЗаписейВТ;
	
	Элементы.ФормаКоличествоЗаписей.Пометка 	 = ПоказыватьКоличествоЗаписейВТ;
	Элементы.РезультатЗамераКоличество.Видимость = ПоказыватьКоличествоЗаписейВТ;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗамерНаСервере()	
	
	РезультатЗамера.Очистить();
	
	Запрос = ИнициализацияЗапроса();
	
	// Через схему запроса 
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Сч = 1;
	Для каждого ЗапросПакета Из СхемаЗапроса.ПакетЗапросов Цикл
		
		ЗапросВыборка = ТипЗнч(ЗапросПакета) = Тип("ЗапросВыбораСхемыЗапроса");
		
		Если ЗапросВыборка Тогда
			ТекстПодзапроса = ЗапросПакета.ПолучитьТекстЗапроса();
		Иначе // Запрос уничтожения ВТ	
		    ТекстПодзапроса = "УНИЧТОЖИТЬ " + ЗапросПакета.ИмяТаблицы;
		КонецЕсли;		
		
		Запрос.Текст = ТекстПодзапроса;
		
		НачалоВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Результат = Запрос.Выполнить();
		
		КонецВыполнения  = ТекущаяУниверсальнаяДатаВМиллисекундах() ;
		
		ВремяВыполнения = (КонецВыполнения - НачалоВыполнения) / 1000;

		НоваяСтрока = РезультатЗамера.Добавить();
		НоваяСтрока.Подзапрос 	 = ТекстПодзапроса;
		НоваяСтрока.Время        = ВремяВыполнения;
		НоваяСтрока.НомерЗапроса = Сч;
		Если ЗапросВыборка Тогда
			НоваяСтрока.ИмяВТ = ЗапросПакета.ТаблицаДляПомещения;		
		КонецЕсли; 
		
		Если ПоказыватьКоличествоЗаписейВТ И ЗапросВыборка Тогда
			Если ЗапросПакета.ТаблицаДляПомещения <> "" Тогда
				НоваяСтрока.Количество = КоличествоЗаписейВоВременнойТаблице(Запрос, ЗапросПакета.ТаблицаДляПомещения);
			Иначе
				НоваяСтрока.Количество = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой).Количество();
			КонецЕсли; 			
		КонецЕсли;
		
		Сч = Сч + 1;
	
	КонецЦикла; 
	
	ОбщееВремя = РезультатЗамера.Итог("Время");
	
КонецПроцедуры

&НаСервере
Функция ИнициализацияЗапроса()

	ПараметрыЗапроса = Объект.Параметры.НайтиСтроки(Новый Структура("ИдентификаторЗапроса", ИдентификаторТекущегоЗапроса));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	РеквизитФормыВЗначение("Объект").ЗагрузкаПараметровВЗапрос(Запрос, ПараметрыЗапроса);
	
	Возврат Запрос;

КонецФункции // ИнициализацияЗапроса()

&НаСервереБезКонтекста
Функция КоличествоЗаписейВоВременнойТаблице(Запрос, ИмяВременнойТаблицы)

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Записей
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВременнаяТаблица", ИмяВременнойТаблицы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Записей;	

КонецФункции // КоличествоЗаписейВТаблице()
